HELYXcore-4.4.0/examples/legacy/compressible/rhoCentralDyMFoam/movingCone/constant/dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
|       o        |                                                            |
|    o     o     |  HELYX (R) : Open-source CFD for Enterprise                |
|   o   O   o    |  Version : 4.4.0                                           |
|    o     o     |  ENGYS Ltd. <http://engys.com/>                            |
|       o        |                                                            |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      dynamicMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

mover
{
    type            motionSolver;
    libs            ( "libfvMeshMovers.so" "libfvMotionSolvers.so" );
    motionSolver    velocityComponentLaplacian;
    component       x;
    diffusivity     directional (1 200 0);
}


// ************************************************************************* //
